import * as React from 'react';

export default class extends React.Component<any> {
  constructor(props: any) {
    super(props);
  }

  render() {
    return <>
      <article className="article-odd">
        <div className='number'>
          1
        </div>
        <div className="thesis">
          Краткое содержание
        </div>
        <div className="text">
          Здесь  мы напишем более подробное объяснение всему, о чем говориться в первом пункте. Это очень важный пункт, поэтому просто необходимо его оформить правильно. Оформление первого элемента списка всегда бросается в глаза.
          Здесь мы напишем более подробное объяснение всему, о чем говориться в первом пункте. Это очень важный пункт, поэтому просто необходимо его оформить правильно. Оформление первого элемента списка всегда бросается в глаза.
          Здесь мы напишем более подробное объяснение всему, о чем говориться в первом пункте. Это очень важный пункт, поэтому просто необходимо его оформить правильно. Оформление первого элемента списка всегда бросается в глаза.
          Здесь мы напишем более подробное объяснение всему, о чем говориться в первом пункте. Это очень важный пункт, поэтому просто необходимо его оформить правильно. Оформление первого элемента списка всегда бросается в глаза.
        </div>
      </article>
      <article className="article-even">
        <div className='number'>
          2
        </div>
        <div className="thesis">
          Краткое содержание
        </div>
        <div className="text">
          Здесь мы напишем более подробное объяснение всему, о чем говориться в первом пункте. Это очень важный пункт, поэтому просто необходимо его оформить правильно. Оформление первого элемента списка всегда бросается в глаза.
          Здесь мы напишем более подробное объяснение всему, о чем говориться в первом пункте. Это очень важный пункт, поэтому просто необходимо его оформить правильно. Оформление первого элемента списка всегда бросается в глаза.
          Здесь мы напишем более подробное объяснение всему, о чем говориться в первом пункте. Это очень важный пункт, поэтому просто необходимо его оформить правильно. Оформление первого элемента списка всегда бросается в глаза.
        </div>
      </article>
      <div className="clear"></div>
      <article className="article-odd">
        <div className='number'>
          3
        </div>
        <div className="thesis">
          Краткое содержание
        </div>
        <div className="text">
          Здесь мы напишем более подробное объяснение всему, о чем говориться в первом пункте. Это очень важный пункт, поэтому просто необходимо его оформить правильно. Оформление первого элемента списка всегда бросается в глаза.
          Здесь мы напишем более подробное объяснение всему, о чем говориться в первом пункте. Это очень важный пункт, поэтому просто необходимо его оформить правильно. Оформление первого элемента списка всегда бросается в глаза.
          Здесь мы напишем более подробное объяснение всему, о чем говориться в первом пункте. Это очень важный пункт, поэтому просто необходимо его оформить правильно. Оформление первого элемента списка всегда бросается в глаза.
          Здесь мы напишем более подробное объяснение всему, о чем говориться в первом пункте. Это очень важный пункт, поэтому просто необходимо его оформить правильно. Оформление первого элемента списка всегда бросается в глаза.
          Здесь мы напишем более подробное объяснение всему, о чем говориться в первом пункте. Это очень важный пункт, поэтому просто необходимо его оформить правильно. Оформление первого элемента списка всегда бросается в глаза.
        </div>
      </article>
      <article className="article-even">
        <div className='number'>
          4
        </div>
        <div className="thesis">
          Краткое содержание
        </div>
        <div className="text">
          Здесь мы напишем более подробное объяснение всему, о чем говориться в первом пункте. Это очень важный пункт, поэтому просто необходимо его оформить правильно. Оформление первого элемента списка всегда бросается в глаза.
          Здесь мы напишем более подробное объяснение всему, о чем говориться в первом пункте. Это очень важный пункт, поэтому просто необходимо его оформить правильно. Оформление первого элемента списка всегда бросается в глаза.
          Здесь мы напишем более подробное объяснение всему, о чем говориться в первом пункте. Это очень важный пункт, поэтому просто необходимо его оформить правильно. Оформление первого элемента списка всегда бросается в глаза.
        </div>
      </article>
      <div className="clear"></div>
      <div className="quote">
        <img src="img/clemanso-fav.png" width="71" height="71" className="quote-img" />
      </div>
      <div className="quote-text">
        Америка – единственная страна, перешедшая из стадии 
        варварства прямо в стадию дегенерации, минуя стадию цивилизации.
        <div className="quote-comment">
          Жорж Клемансо, премьер-министр Франции
          Из выступления в Сенате США
        </div>
      </div>
      <div className="quote">
        <img src="img/kav.png" width="71" height="71" className="quote-img" />
      </div>
      <div className="quote-text">
        Наиболее важными вопросами, обсуждавшимися при составлении условий мирного договора, являлись проблема размеров репараций и срока их выплат, 
        территориальный вопрос и вопрос об ответственности за развязывание войны со стороны Германии. Основные требования Франции по отношению к Германии сводились к следующему: 
        необходимо судить виновников войны во главе с кайзером Германии; раздробить Германию путем отделения от нее Баварии и образования так называемой Рейнской области под протекторатом 
        Франции; передать Саарский угольный бассейн Франции; полностью ликвидировать вооруженные силы Германии; добиться стопроцентного возмещения Германией нанесенного ею ущерба и оплаты пенсий жертвам войны.
        <div className="quote-comment">
          Из текста мирного соглашения, подписанного на Парижской конференции
        </div>
      </div>
      <div className="header-block-first">
        <span>
         Корниловский мятеж и заговор Керенского провалились
        </span>
      </div>
      <div className="header-block-second">
        <span>
         Корниловский мятеж и заговор Керенского провалились
        </span>
      </div>
    </>
  } 
}
